# coding=gbk
"""
作者：川川
时间：2021/8/23
群：970353786
"""
mytuple = ("川川一号", "川川二号", "川川三号")
print(mytuple[1])

mytuple = ("川川一号", "川川二号", "川川三号")
print(mytuple[-1])

mytuple = ("川川一号", "川川二号", "川川三号",'帅哥川川','川川真棒')
print(mytuple[2:5])

mytuple = ("川川一号", "川川二号", "川川三号",'帅哥川川','川川真棒')
print(mytuple[:4])


mytuple = ("川川一号", "川川二号", "川川三号",'帅哥川川','川川真棒')
print(mytuple[2:])

mytuple = ("川川一号", "川川二号", "川川三号",'帅哥川川','川川真棒')
print(mytuple[-4:-1])


thistuple = ("川川一号", "川川二号", "川川三号",'帅哥川川','川川真棒')
if "帅哥川川" in thistuple:
  print("哈哈, 帅哥川川' 在元祖列表")
